import { SchoolData } from './types';

export const RECRUITMENT_DATA: SchoolData[] = [
    { "교육지원청": "강남서초", "공통참여자": 3, "입학설명회만": 8, "캠프만": 0, "총인원": 11, "lat": 37.4979, "lon": 127.0276 },
    { "교육지원청": "강동송파", "공통참여자": 10, "입학설명회만": 7, "캠프만": 3, "총인원": 20, "lat": 37.5301, "lon": 127.1238 },
    { "교육지원청": "강서양천", "공통참여자": 5, "입학설명회만": 19, "캠프만": 2, "총인원": 26, "lat": 37.5509, "lon": 126.8495 },
    { "교육지원청": "남부", "공통참여자": 11, "입학설명회만": 17, "캠프만": 5, "총인원": 33, "lat": 37.4814, "lon": 126.8954 },
    { "교육지원청": "동부", "공통참여자": 2, "입학설명회만": 4, "캠프만": 0, "총인원": 6, "lat": 37.5744, "lon": 127.0397 },
    { "교육지원청": "동작관악", "공통참여자": 15, "입학설명회만": 30, "캠프만": 6, "총인원": 51, "lat": 37.4784, "lon": 126.9514 },
    { "교육지원청": "북부", "공통참여자": 4, "입학설명회만": 4, "캠프만": 4, "총인원": 12, "lat": 37.6397, "lon": 127.0255 },
    { "교육지원청": "서부", "공통참여자": 8, "입학설명회만": 10, "캠프만": 3, "총인원": 21, "lat": 37.5663, "lon": 126.9368 },
    { "교육지원청": "성동광진", "공통참여자": 6, "입학설명회만": 3, "캠프만": 7, "총인원": 16, "lat": 37.5635, "lon": 127.0366 },
    { "교육지원청": "성북강북", "공통참여자": 1, "입학설명회만": 5, "캠프만": 1, "총인원": 7, "lat": 37.5894, "lon": 127.0167 },
    { "교육지원청": "중부", "공통참여자": 0, "입학설명회만": 4, "캠프만": 0, "총인원": 4, "lat": 37.5639, "lon": 126.9975 }
];

export const SEOUL_GEOJSON_URL = 'https://raw.githubusercontent.com/southkorea/seoul-maps/master/kostat/2013/json/seoul_municipalities_geo_simple.json';

export const MIRIM_LOCATION: [number, number] = [37.4809, 126.9306];
